# Dotfiles Brewfile
# Install everything: brew bundle --file=~/dotfiles/Brewfile
# Install specific:   brew bundle --file=~/dotfiles/Brewfile --only=formulae

# ============================================================================
# Taps
# ============================================================================
tap "homebrew/cask-fonts"
tap "homebrew/bundle"

# ============================================================================
# Essential (Required)
# ============================================================================
brew "git"
brew "zsh"
brew "neovim"
brew "starship"

# ============================================================================
# Terminal & Shell
# ============================================================================
brew "fzf"                # Fuzzy finder
brew "zoxide"             # Smart cd (z)
brew "eza"                # Modern ls replacement
brew "bat"                # Better cat
brew "fd"                 # Fast find
brew "ripgrep"            # Fast grep (rg)
brew "delta"              # Better git diff
brew "lazygit"            # Git TUI
brew "htop"               # Process viewer
brew "tree"               # Directory tree
brew "jq"                 # JSON processor
brew "yq"                 # YAML processor
brew "tldr"               # Simplified man pages
brew "thefuck"            # Command correction

# ============================================================================
# Development
# ============================================================================
brew "node"               # Node.js
brew "python"             # Python
brew "go"                 # Go
brew "rust"               # Rust
brew "lua"                # Lua
brew "luarocks"           # Lua package manager
brew "cmake"              # Build system
brew "make"               # Build tool
brew "gcc"                # Compiler

# ============================================================================
# Applications (Casks)
# ============================================================================
cask "wezterm"            # Terminal emulator
cask "visual-studio-code" # Code editor
cask "arc"                # Browser
cask "raycast"            # Launcher
cask "1password"          # Password manager
cask "docker"             # Containers
cask "postman"            # API client
cask "tableplus"          # Database GUI

# ============================================================================
# Communication
# ============================================================================
cask "discord"            # Chat
cask "slack"              # Work chat
cask "notion"             # Notes

# ============================================================================
# Creative
# ============================================================================
cask "figma"              # Design
cask "spotify"            # Music

# ============================================================================
# Fonts (Nerd Fonts for terminal icons)
# ============================================================================
cask "font-jetbrains-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono-nerd-font"
